#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.iam.azurerm_role_assignment.certificates_user will be destroyed
  # (because azurerm_role_assignment.certificates_user is not in configuration)
  - resource "azurerm_role_assignment" "certificates_user" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-kv/providers/Microsoft.Authorization/roleAssignments/487ac51e-0adf-7136-fe5f-d0cd0c057b5b" -> null
      - name                                   = "487ac51e-0adf-7136-fe5f-d0cd0c057b5b" -> null
      - principal_id                           = "547c5240-b77f-4ece-a82f-293ec05397c1" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/db79e9a7-68ee-4b58-9aeb-b90e7c24fcba" -> null
      - role_definition_name                   = "Key Vault Certificate User" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-kv" -> null
        # (4 unchanged attributes hidden)
    }

  # module.key_vaults.module.key_vault_role_assignments.azurerm_role_assignment.certificates["io-p-sec-rg|io-p-kv|reader"] will be created
  + resource "azurerm_role_assignment" "certificates" {
      + condition_version                = (known after apply)
      + description                      = "It is required so the CDN can get the certificates stored in the key vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7a1ef28a-d63c-47d2-be10-98cb7b66a1b9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Certificate User"
      + scope                            = "/subscriptions//subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-kv"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.cdn.azurerm_storage_container.well_known,
  on ../_modules/cdn/storage_account.tf line 29, in resource "azurerm_storage_container" "well_known":
  29:   storage_account_name = azurerm_storage_account.this.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
